
pages array
[
    {
        pageType: "html",
        elements: [
            {
                type: "display",
                shown: false,
                fadeIn: 300,
            },
            {

            }
    
        ]
    },
    {
        pageType: "game",
        name: ""s
    }
]
















const clues = [
    {
        text: 
        "Dinner is served, I present you your plate
        This clue might leave you in a different state
        Maybe all you need is a kick in the rear
        So hurry on up, get your ass into gear
        I hope you keep searching until you exhaust
        How far will go? And what will it cost?",
        hint: "duck tape can solve most of your problems"
        answer: "emma's drive",
    },
    {
        text:
        "This next clue might leave you frozen in place
        The cracks starting to show upon your face
        Get down on one knee and I'll make you a knight
        Then step out of that shell into the limelight
        Oh wait, you can't go in, there's no snaccs allowed
        What a shame. Time to lay down and look at the clouds",
        hint: "",
        answer: ""
    },
    {
        text:
        "It’s time to leave Maine. We’ve all had our fill
        Lobster and oysters are just are run of the mill
        Lets take a trip. We’ll start with fair Pareé
        To find love here you’ll need more than a key
        Next up Berlin: let your worries all cease
        Instead look it over and see it fall into peace",
        answer: "",
        hint; ""
    },
    {
        text:
        "Close your eyes and let the waves lull  you to sleep
        Dreams of diving off clifftops to oceans so deep
        Fairies whisk you away to lands far far away
        At the top of a mountain, a price to be paid
        Glittering diamonds in exchange for a soul
        Night is coming. And it’s for you whom the bell tolls",
        answer: "",
        hint: "The ship's about to leave, haul up that anchor"
    },
    {
        text:
        "The spider dangles from its web and crosses the street
        There’s a chill in the air where different heads meet
        They'll steal your soul unless you hold your breath
        But try all you might there's no avoiding death
        In times of lost hope think back to the birds
        Let the trail be your guide, behind resting words",
        answer: "",
        hint: "The sun rises over the stones below"
    }
]


The game’s coming to an end
You filled me up like my favorite teacup


// User page info
{
    userId,
    questId,
    pageI
}


QuestPage Model
{
    userId,
    questId,
    elements: [
        {
            elementId,
            shown: false,

        }
    ]
}

PageElementModel {
    {
        
    }
}


Quest Model
{
    creator: "sean",
    steps: [
        {
            id: "step1",
            elements: [
                {
                    elementId: 15,
                    elementType: "scrolling-text",
                    actualValue: null
                },
                {

                },
                {

                }
            ],
            events: {
                15: {
                    click: [
                        {20, "focus", {}},
                        {25, "hide", {delay: 3}}
                        {40, "expand", {scale: 20}}
                    ],
                    hover: [
                        {20, "hide", {}}
                    ]
                },
                25: {

                }
            }
        },
    ]
}


Event chain ->
